#3) Пользователь вводит температуру в градусах Цельсия. Вывести температуру в градусах фаренгейта
#При переводе из шкалы Цельсия в шкалу Фаренгейта исходную цифру умножают на 9/5 и прибавляют 32.

x = int(input())

x1 = x*(9/5)+32

print(x1)