#6. Написать функцию-фабрику, которая будет возвращать функцию умножения на аргумент
#Пример:


def multiple_inner(a):
    return a

mult5 = multiple_inner(5)
print(mult5(7))
#35

